import i18n from "i18next";
import { initReactI18next } from "react-i18next";

import LanguageDetector from "i18next-browser-languagedetector";


i18n
    .use(LanguageDetector)
    .use(initReactI18next)
    .init({
        // react: {
        //     useSuspense: false
        // },
        
        resources: {
            ua: {
                translation: {
                    "tabBar": {
                        "Instraction": "Інструкція",
                        "Letter": "Літери",
                        "Syllable": "Склади",
                        "Words": "Слова",
                        "Language": "Мова",
                    },
                    "videoBlock": {
                        "Play/pause": "старт/стоп",
                        "Pronounce": "Вимова"
                    },
                    "Manual": {
                        "LetterTitle": "Закладка ЛІТЕРИ",
                        "LetterBody": {
                            "Paragraph1": "Тренажер демонструє рукописне написання всіх букв українського алфавіту, великих і малих.",
                            "Paragraph2":   "Клацнути мишкою на букву. Внизу на екрані з’явиться графічне зображення процесу написання кожного елемента " +
                                            "букви. Є можливість зупинити і продовжити демонстрацію (кнопка СТАРТ/СТОП). Для прослуховування букв " +
                                            "українського алфавіту є кнопка  ВИМОВА, яка відкриває Google Перекладач. Не використовуйте мобільний додаток " +
                                            "Google перекладача, при використанні мобільного пристрою, використовуйте веб версію.", 
                        },
                        "SyllableTitle": "Закладка СКЛАДИ",
                        "SyllableBody": {
                            "Paragraph1": "Тренажер демонструє правильне з’єднання букв у складах. Це необхідно для формування навичок безвідривного письма слів в українській мові.",
                            "Paragraph2":   "Клацнути мишкою на букву. З’явиться випадаюче вікно із складами. Клацнути мишкою на склад. Внизу на екрані " + 
                                            "з’явиться графічне зображення процесу написання складу. Є можливість зупинити і продовжити демонстрацію (кнопка СТАРТ/СТОП). "+ 
                                            "Для прослуховування є кнопка  ВИМОВА, яка відкриває Google Перекладач."                        
                        },
                        "WordTitle": "Закладка СЛОВА",
                        "WordBody": {
                            "Paragraph1": "Тренажер демонструє правильне з’єднання букв у словах. Це сприяє формуванню навичок ритмічного письма " + 
                                            "(букви пишуться на однаковій відстані одна від одної, однаковими по висоті і ширині, з однаковим нахилом). " + 
                                            "Приклади слів подані з перекладом англійською і китайською мовами.",
                            "Paragraph2":   "Клацнути мишкою на слово. Внизу на екрані з’явиться графічне зображення процесу написання слова. " + 
                                            "Є можливість зупинити і продовжити демонстрацію (кнопка СТАРТ/СТОП). Для прослуховування є кнопка " + 
                                            "ВИМОВА, яка відкриває Google Перекладач."                        
                        },
                    }
                }
            },
            ru: {
                translation: {
                    "tabBar": {
                        "Instraction": "Инструкция",
                        "Letter": "Буквы",
                        "Syllable": "Слоги",
                        "Words": "Слова",
                        "Language": "Язык",
                    },
                    "videoBlock": {
                        "Play/pause": "старт/стоп",
                        "Pronounce": "Произношение"
                    },
                }
            },
            en: {
                translation: {
                    "tabBar": {
                        "Instraction": "Instraction",
                        "Letter": "Letter",
                        "Syllable": "Syllables",
                        "Words": "Words",
                        "Language": "Language",
                    },
                    "videoBlock": {
                        "Play/pause": "Play/pause",
                        "Pronounce": "Pronounce"
                    },
                }
            }
        },
        
        fallbackLng: "en",
        lng: "ua",

        interpolation: {
            escapeValue: false, // not needed for react!!
        },
})

export default i18n;